package homeWorks;

/*
Коллекции
Написать методы union(Set set1, Set set2) и intersect(Set set1, Set set2), реализующих операции объединения и пересечения двух множеств.
Протестировать работу методов на двух предварительно заполненных множествах.
(Вам понадобится написать вспомогательный метод, выводящий все элементы множества в консоль).
Под пересечением следует понимать выделение в коллекцию объектов, содержащихся в каждой из коллекций (т.е. одинаковых элементов, встречающихся в каждой коллекции).
Например:
Коллекция 1: 1,2,3,5,7,8
Коллекция 2: 1,6,9,14,3,7
Результат работы union: 1,2,3,5,7,8,1,6,9,14,3,7
Результат работы intersect: 1,3,7
*/

public class TaskCollections4 {
    public static void main(String[] args) {

    }
}
