package homeWorks;

/*
Коллекции
Написать класс Student, предоставляющий информацию об имени студента методом getName() и о его курсе методом getCourse().
Написать метод printStudents(List students, int course), который получает список студентов и номер курса и печатает
в консоль имена тех студентов из списка, которые обучаются на данном курсе. Для обхода списка в этом методе использовать итератор.

Протестировать метод - создав предварительно десять объектов класса Student и поместив их в список.
*/

public class TaskCollections3 {
    public static void main(String[] args) {

    }
}
